app/controllers/books_controller.rb

	def index
		if params[:category].blank?
			@books = Book.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
			@books = Book.where(:category_id => @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Technology"], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = $1 ORDER BY created_at DESC  [["category_id", 3]]

	def create
		@book = current_user.books.build(book_params)
		@book.category_id = params[:category_id]

		if @book.save
---
INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at", "user_id", "category_id", "book_img_file_name", "book_img_content_type", "book_img_file_size", "book_img_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

	def update
		@book.category_id = params[:category_id]
		if @book.update(book_params)
---
UPDATE "books" SET "book_img_file_name" = $1, "book_img_content_type" = $2, "book_img_file_size" = $3, "book_img_updated_at" = $4, "updated_at" = $5 WHERE "books"."id" = $6

	def destroy
		if @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 8]]