app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "enabled", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sas"], ["enabled", true], ["created_at", "2019-04-21 15:07:53.021436"], ["updated_at", "2019-04-21 15:07:53.021436"]]
---
	def create
		@category = Category.new(category_params)

		if @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "categories" SET "enabled" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["enabled", true], ["updated_at", "2019-04-21 15:11:54.716696"], ["id", 2]]
---
	def update
		@category = Category.find(params[:id])

		if @category.update(category_params)