app/controllers/reviews_controller.rb

	def create
		@review = Review.new(review_params)
		@review.book_id = @book.id
		@review.user_id = current_user.id

		if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "book_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 5], ["comment", "Well Book, Must Readyyy!"], ["created_at", "2019-04-05 02:56:14.190306"], ["updated_at", "2019-04-05 02:56:14.190306"], ["user_id", 2], ["book_id", 5]]

	def update
		@review = Review.find(params[:id])

		if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "reviews" SET "rating" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["rating", 1], ["updated_at", "2019-04-04 13:39:50.566354"], ["id", 6]]