app/controllers/rooms_controller.rb

  def show
  	@messages = Messenger.all
---
SELECT "messengers".* FROM "messengers"